
Функция ВыполнитьЗапрос(Параметры, ТекстЗапроса, ТекстОшибки = "") Экспорт
	
	Соединение = СоздатьСоединение(Параметры);
	
	Если Соединение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Команда = СоздатьКоманду(Параметры);
	
	Если Команда = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Команда.ActiveConnection = Соединение;
	Команда.CommandText = ТекстЗапроса;
	
	Попытка
		Команда.Execute();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Соединение.Close();
	
	Возврат Истина;
	
КонецФункции

Функция СоздатьСоединение(Параметры)
	
	Если Не Параметры.Свойство(Параметры.Сервер) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Соединение = Новый COMОбъект("ADODB.Connection");
		Соединение.ConnectionString = СтрШаблон("Provider=SQLOLEDB.1;Integrated Security=SSPI;Persist Security Info=true;Data Source=%1;", Параметры.Сервер);
		Соединение.Open();
		Возврат Соединение;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция СоздатьКоманду(Параметры)
	
	Попытка
		Команда = Новый COMОбъект("ADODB.Command");
		Команда.TimeOut = ?(Параметры.Свойство("TimeOut"), Параметры.TimeOut, ТаймаутПоУмолчанию());
		Возврат Команда;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ТаймаутПоУмолчанию()
	Возврат 7200;
КонецФункции
